app/controllers/tags_controller.rb

  def destroy
    @tag= Tag.destroy(params[:id])
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]